//======= 18.08.2022 =========
//splice , slice , forEach , includes, find , filter , findIndex , map,  push, pop , shift ,  unshift ,
// indexOf

//методы

/*
* добавлем и извлекаем елементы

pop - удаляет елемент из конца(возвращает удаленный елемент)

push - добавляет елемент в конец масива

shift -  удаляет значение из начала масива и переиндексирует масив (возвращает удаленный елемент)

unshift - добавляет елемент в начало масива и переиндексирует масив (возвращает новую длину масива)

*/

/*
* вырезаем елементы из масивов

splice - 
slice(num, num2) -  не меняет исходный масив , копирует исходный масив начиная с числа которое задано в 
						  параметре первым(num), и до числа заданого вторым(num2)
						  slice МОЖНА ПРИМЕНЯТЬ К СТРОКЕ
! ДЛЯ ЧЕГО НУЖЕН SLICE 
! ЕСЛИ НЕОБХОДИМО СОЗДАТЬ МАСИВ НА ОСНОВЕ ИСХОДНОГО НЕ ИЗМЕНЯЯ ИСХОДНЫЙ И СКОПИРОВАТЬ ТУДА
! ПОСЛЕДОВАТЕЛЬНО ЕЛЕМЕНТЫ (копирует от первого включительно до второго не включительно)

*/



/*
* перебор масивов

indexOf- возврвщает индек елемента
forEach -
filter - возвращает елемент если он true
map - возвращает измененный елемент масива
includes - возвращает елемент 


*/